# Target vs Frequency Encoding

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("Carseats.csv")

In [3]:
df.head()
#df.tail()

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,120,Bad,42,17,Yes,Yes
1,11.22,111,48,16,260,83,Good,65,10,Yes,Yes
2,10.06,113,35,10,269,80,Medium,59,12,Yes,Yes
3,7.40,117,100,4,466,97,Medium,55,14,Yes,Yes
4,4.15,141,64,3,340,128,Bad,38,13,Yes,No

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    object
 6   ShelveLoc    399 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    object
 9   Urban        400 non-null    object
 10  US           397 non-null    object
dtypes: float64(1), int64(5), object(5)
memory usage: 34.5+ KB

In [3]:
# Null qiymatlar bor yo'qligini aniqlash
df.isnull().sum()

Sales          0
CompPrice      0
Income         0
Advertising    0
Population     0
Price          0
ShelveLoc      1
Age            0
Education      0
Urban          0
US             3
dtype: int64

In [4]:
# Faqat  Null qiymatlar bor ustunlarni chiqarish
missing_columns=df.isnull().sum()
missing_columns=missing_columns[missing_columns>0]

if not missing_columns.empty:
    print(f"Null qiymatlar bor ustunlar:\n{missing_columns} ")
else:
    print("Null  qiymatlari bor ustun mavjud emas.")

Null qiymatlar bor ustunlar:
ShelveLoc    1
US           3
dtype: int64

In [7]:
df.describe()

            Sales   CompPrice      Income  Advertising  Population         Age
count  400.000000  400.000000  400.000000   400.000000  400.000000  400.000000
mean     7.496325  124.975000   68.657500     6.635000  264.840000   53.105000
std      2.824115   15.334512   27.986037     6.650364  147.376436   16.432408
min      0.000000   77.000000   21.000000     0.000000   10.000000   12.000000
25%      5.390000  115.000000   42.750000     0.000000  139.000000   39.000000
50%      7.490000  125.000000   69.000000     5.000000  272.000000   54.000000
75%      9.320000  135.000000   91.000000    12.000000  398.500000   66.000000
max     16.270000  175.000000  120.000000    29.000000  509.000000   80.000000

In [14]:
# Null qiymatlari bor ustunlarni hammasini drop qilib tashlab yuborish

df.dropna(axis=1,inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    object
 6   Age          400 non-null    int64
 7   Education    400 non-null    object
 8   Urban        400 non-null    object
dtypes: float64(1), int64(5), object(3)
memory usage: 28.3+ KB

In [6]:
# Null qiymatlari bor qatorlarni hammasini tashlab yuborish codi

df.dropna(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 396 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        396 non-null    float64
 1   CompPrice    396 non-null    int64
 2   Income       396 non-null    int64
 3   Advertising  396 non-null    int64
 4   Population   396 non-null    int64
 5   Price        396 non-null    object
 6   ShelveLoc    396 non-null    object
 7   Age          396 non-null    int64
 8   Education    396 non-null    object
 9   Urban        396 non-null    object
 10  US           396 non-null    object
dtypes: float64(1), int64(5), object(5)
memory usage: 37.1+ KB

In [4]:
# Null qiymatlari bor ustunlarni mode() va mean() funksiyalri orqaliumumiy  to'ldirish codi
missing_col=df.columns[df.isnull().sum()>0]

for col in missing_col:
    if df[col].dtypes=="object":
        df[col].fillna(df[col].mode()[0],inplace=True)
    else:
        df[col].fillna(df[col].mean(),inplace=True)

/var/folders/kx/n6bh82zd3w5_blhwkxh6d2440000gn/T/ipykernel_5226/2710688982.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mode()[0],inplace=True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    object
 6   ShelveLoc    400 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    object
 9   Urban        400 non-null    object
 10  US           400 non-null    object
dtypes: float64(1), int64(5), object(5)
memory usage: 34.5+ KB

In [11]:
df.head()

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,120,Bad,42,17,Yes,Yes
1,11.22,111,48,16,260,83,Good,65,10,Yes,Yes
2,10.06,113,35,10,269,80,Medium,59,12,Yes,Yes
3,7.40,117,100,4,466,97,Medium,55,14,Yes,Yes
4,4.15,141,64,3,340,128,Bad,38,13,Yes,No

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    object
 6   ShelveLoc    400 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    object
 9   Urban        400 non-null    object
 10  US           400 non-null    object
dtypes: float64(1), int64(5), object(5)
memory usage: 34.5+ KB

In [5]:
# Datasetni tozalash 
# Muommoli ustunni qiymatlarini aniqlash

df["Price"].unique()

array(['120', '83', '80', '97', '128', '72', '108', '124', '100', '94',
       '136', '86', '118', '144', '110', '131', '68', 'Medium', '109',
       '138', 'Bad', '82', '107', '102', '89', '137', '96', '126', '24',
       '134', '95', '135', '70', '98', '149', '129', '119', '154', '84',
       '117', '103', '114', '123', '133', '101', '104', '91', '115', '99',
       '150', '116', '92', '145', '90', '79', '139', '121', '112', '111',
       '125', '148', '132', '127', '106', '151', '87', '155', '49', '147',
       '77', '159', '69', '157', '160', '141', '191', '93', '55', '185',
       '122', '81', '140', '173', '146', '130', '64', '105', '163', '88',
       '156', '166', '63', '158', '113', '74', '54', '171', '152', '143',
       '164', '162', '53', '78'], dtype=object)

In [6]:
# o'sha ustun  barcha qiymatlarini sonini ekranga chiqarish
len(df['Price'])

400

In [7]:
# Duplikat yani bitta yoki bir nechta qiymat takror takror berilganligi dublikat qilingan yoki yo'qligini aniqlash
len(df["Price"].unique())

103

In [6]:
#  datasetni tozalash
# Muommoni to'g'rilash

df["Price"]=pd.to_numeric(df["Price"],errors="coerce")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        398 non-null    float64
 6   ShelveLoc    400 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    object
 9   Urban        400 non-null    object
 10  US           400 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 34.5+ KB

In [9]:
len(df["Price"].unique())

102

In [10]:
len(df["Price"])

400

In [8]:
# Null qiymatlari bor ustunlarni mode() va mean() funksiyalri orqaliumumiy  to'ldirish codi
missing_col=df.columns[df.isnull().sum()>0]

for col in missing_col:
    if df[col].dtypes=="object":
        df[col].fillna(df[col].mode()[0],inplace=True)
    else:
        df[col].fillna(df[col].mean(),inplace=True)

/var/folders/kx/n6bh82zd3w5_blhwkxh6d2440000gn/T/ipykernel_5035/2710688982.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mean(),inplace=True)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    float64
 6   ShelveLoc    400 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    object
 9   Urban        400 non-null    object
 10  US           400 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 34.5+ KB

# Encoding ( One-hot encoding)

In [11]:
# Qaysi ustunda categorical qiymatlar bo'lsa o'sha ustunlarni aniqlash

categorical_col=df.select_dtypes(include=['object','category']).columns
categorical_col

Index(['ShelveLoc', 'Education', 'Urban', 'US'], dtype='object')

In [12]:
# One-hot encoding
# Categorical bo'lgan barcha ustunlarni one-hot encoding metodi orqali numericalga o'tkazish

df.one_hot=pd.get_dummies(df, columns=categorical_col, drop_first=True)

/var/folders/kx/n6bh82zd3w5_blhwkxh6d2440000gn/T/ipykernel_5035/1223951232.py:4: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.one_hot=pd.get_dummies(df, columns=categorical_col, drop_first=True)

In [13]:
df.one_hot

,Sales,CompPrice,Income,Advertising,Population,Price,Age,ShelveLoc_69,ShelveLoc_Bad,ShelveLoc_Good,...,Education_12,Education_13,Education_14,Education_15,Education_16,Education_17,Education_18,Education_Yes,Urban_Yes,US_Yes
0,9.50,138,73,11,276,120.0,42,False,True,False,...,False,False,False,False,False,True,False,False,True,True
1,11.22,111,48,16,260,83.0,65,False,False,True,...,False,False,False,False,False,False,False,False,True,True
2,10.06,113,35,10,269,80.0,59,False,False,False,...,True,False,False,False,False,False,False,False,True,True
3,7.40,117,100,4,466,97.0,55,False,False,False,...,False,False,True,False,False,False,False,False,True,True
4,4.15,141,64,3,340,128.0,38,False,True,False,...,False,True,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
395,12.57,138,108,17,203,128.0,33,False,False,True,...,False,False,True,False,False,False,False,False,True,True
396,6.14,139,23,3,37,120.0,55,False,False,False,...,False,False,False,False,False,False,False,False,False,True
397,7.41,162,26,12,368,159.0,40,False,False,False,...,False,False,False,False,False,False,True,False,True,True
398,5.94,100,79,7,284,95.0,50,False,True,False,...,True,False,False,False,False,False,False,False,True,True
399,9.71,134,37,0,27,120.0,49,False,False,True,...,False,False,False,False,True,False,False,False,True,True

In [17]:
df=df.one_hot.astype(int)

AttributeError: 'DataFrame' object has no attribute 'one_hot'

In [18]:
df.head()

,Sales,CompPrice,Income,Advertising,Population,Price,Age,ShelveLoc_69,ShelveLoc_Bad,ShelveLoc_Good,...,Education_12,Education_13,Education_14,Education_15,Education_16,Education_17,Education_18,Education_Yes,Urban_Yes,US_Yes
0,9,138,73,11,276,120,42,0,1,0,...,0,0,0,0,0,1,0,0,1,1
1,11,111,48,16,260,83,65,0,0,1,...,0,0,0,0,0,0,0,0,1,1
2,10,113,35,10,269,80,59,0,0,0,...,1,0,0,0,0,0,0,0,1,1
3,7,117,100,4,466,97,55,0,0,0,...,0,0,1,0,0,0,0,0,1,1
4,4,141,64,3,340,128,38,0,1,0,...,0,1,0,0,0,0,0,0,1,0

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 22 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Sales             400 non-null    int64
 1   CompPrice         400 non-null    int64
 2   Income            400 non-null    int64
 3   Advertising       400 non-null    int64
 4   Population        400 non-null    int64
 5   Price             400 non-null    int64
 6   Age               400 non-null    int64
 7   ShelveLoc_69      400 non-null    int64
 8   ShelveLoc_Bad     400 non-null    int64
 9   ShelveLoc_Good    400 non-null    int64
 10  ShelveLoc_Medium  400 non-null    int64
 11  Education_11      400 non-null    int64
 12  Education_12      400 non-null    int64
 13  Education_13      400 non-null    int64
 14  Education_14      400 non-null    int64
 15  Education_15      400 non-null    int64
 16  Education_16      400 non-null    int64
 17  Education_17      400 non-null    int64
 18  Education_18      400 non-null    int64
 19  Education_Yes     400 non-null    int64
 20  Urban_Yes         400 non-null    int64
 21  US_Yes            400 non-null    int64
dtypes: int64(22)
memory usage: 68.9 KB

In [4]:
# OneHot encoder 
from sklearn.preprocessing import OneHotEncoder # Kutubxonadan chaqirdik

In [5]:
categorical_col=df.select_dtypes(include=['object','category']).columns
categorical_col

Index(['Price', 'ShelveLoc', 'Education', 'Urban', 'US'], dtype='object')

In [6]:
one_hot=OneHotEncoder(sparse_output=False, drop='first')  # One_hot encoder deb o'zgaruvchi belgilab oldik

In [7]:
df_encoded=one_hot.fit_transform(df[categorical_col])    #  categoricaldan numericalga tranform qildish

In [8]:
df_encoded

array([[0., 0., 0., ..., 0., 1., 1.],
       [0., 0., 0., ..., 0., 1., 1.],
       [0., 0., 0., ..., 0., 1., 1.],
       ...,
       [0., 0., 0., ..., 0., 1., 1.],
       [0., 0., 0., ..., 0., 1., 1.],
       [0., 0., 0., ..., 0., 1., 1.]], shape=(400, 117))

In [9]:
encoded_col=one_hot.get_feature_names_out(categorical_col)   # yangi ochilgan ustunlarga nom berish codi

In [11]:
encoded_col

array(['Price_101', 'Price_102', 'Price_103', 'Price_104', 'Price_105',
       'Price_106', 'Price_107', 'Price_108', 'Price_109', 'Price_110',
       'Price_111', 'Price_112', 'Price_113', 'Price_114', 'Price_115',
       'Price_116', 'Price_117', 'Price_118', 'Price_119', 'Price_120',
       'Price_121', 'Price_122', 'Price_123', 'Price_124', 'Price_125',
       'Price_126', 'Price_127', 'Price_128', 'Price_129', 'Price_130',
       'Price_131', 'Price_132', 'Price_133', 'Price_134', 'Price_135',
       'Price_136', 'Price_137', 'Price_138', 'Price_139', 'Price_140',
       'Price_141', 'Price_143', 'Price_144', 'Price_145', 'Price_146',
       'Price_147', 'Price_148', 'Price_149', 'Price_150', 'Price_151',
       'Price_152', 'Price_154', 'Price_155', 'Price_156', 'Price_157',
       'Price_158', 'Price_159', 'Price_160', 'Price_162', 'Price_163',
       'Price_164', 'Price_166', 'Price_171', 'Price_173', 'Price_185',
       'Price_191', 'Price_24', 'Price_49', 'Price_53', 'Price_54',
       'Price_55', 'Price_63', 'Price_64', 'Price_68', 'Price_69',
       'Price_70', 'Price_72', 'Price_74', 'Price_77', 'Price_78',
       'Price_79', 'Price_80', 'Price_81', 'Price_82', 'Price_83',
       'Price_84', 'Price_86', 'Price_87', 'Price_88', 'Price_89',
       'Price_90', 'Price_91', 'Price_92', 'Price_93', 'Price_94',
       'Price_95', 'Price_96', 'Price_97', 'Price_98', 'Price_99',
       'Price_Bad', 'Price_Medium', 'ShelveLoc_69', 'ShelveLoc_Bad',
       'ShelveLoc_Good', 'ShelveLoc_Medium', 'Education_11',
       'Education_12', 'Education_13', 'Education_14', 'Education_15',
       'Education_16', 'Education_17', 'Education_18', 'Education_Yes',
       'Urban_Yes', 'US_Yes'], dtype=object)

In [16]:
# yangi ochilgan ustunlarni bo'glash va eskilarini o'chirib yuborish

df_encoded = pd.DataFrame(df_encoded)  
df = pd.concat([df.drop(columns=categorical_col), df_encoded], axis=1)

In [17]:
df.head()

,Sales,CompPrice,Income,Advertising,Population,Age,0,1,2,3,...,107,108,109,110,111,112,113,114,115,116
0,9.50,138,73,11,276,42,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,1.0
1,11.22,111,48,16,260,65,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0
2,10.06,113,35,10,269,59,0.0,0.0,0.0,0.0,...,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0
3,7.40,117,100,4,466,55,0.0,0.0,0.0,0.0,...,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,1.0
4,4.15,141,64,3,340,38,0.0,0.0,0.0,0.0,...,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Columns: 123 entries, Sales to 116
dtypes: float64(118), int64(5)
memory usage: 384.5 KB

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    object
 6   ShelveLoc    400 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    object
 9   Urban        400 non-null    object
 10  US           400 non-null    object
dtypes: float64(1), int64(5), object(5)
memory usage: 34.5+ KB

In [6]:
categorical_col=df.select_dtypes(include=['object','category']).columns
categorical_col

Index(['Price', 'ShelveLoc', 'Education', 'Urban', 'US'], dtype='object')

In [7]:
# Label encoding
from sklearn.preprocessing import LabelEncoder # kutubxonadan chaqirish
label_encoder=LabelEncoder()

df[categorical_col]=df[categorical_col].apply(label_encoder.fit_transform)

In [8]:
df.head()

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,20,2,42,7,1,1
1,11.22,111,48,16,260,85,3,65,0,1,1
2,10.06,113,35,10,269,82,4,59,2,1,1
3,7.40,117,100,4,466,98,4,55,4,1,1
4,4.15,141,64,3,340,28,2,38,3,1,0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    int64
 6   ShelveLoc    400 non-null    int64
 7   Age          400 non-null    int64
 8   Education    400 non-null    int64
 9   Urban        400 non-null    int64
 10  US           400 non-null    int64
dtypes: float64(1), int64(10)
memory usage: 34.5 KB

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    object
 6   ShelveLoc    400 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    object
 9   Urban        400 non-null    object
 10  US           400 non-null    object
dtypes: float64(1), int64(5), object(5)
memory usage: 34.5+ KB

In [7]:
categorical_col=df.select_dtypes(include=['object','category']).columns
categorical_col

Index(['Price', 'ShelveLoc', 'Education', 'Urban', 'US'], dtype='object')

In [8]:
# Frequency encoding 

df[categorical_col]=df[categorical_col].apply(lambda col: col.map(col.value_counts()))

In [9]:
df.head()

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,12,95,42,49,281,259
1,11.22,111,48,16,260,2,84,65,48,281,259
2,10.06,113,35,10,269,2,219,59,47,281,259
3,7.40,117,100,4,466,9,219,55,40,281,259
4,4.15,141,64,3,340,12,95,38,43,281,141

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    int64
 6   ShelveLoc    400 non-null    int64
 7   Age          400 non-null    int64
 8   Education    400 non-null    int64
 9   Urban        400 non-null    int64
 10  US           400 non-null    int64
dtypes: float64(1), int64(10)
memory usage: 34.5 KB

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    object
 6   ShelveLoc    400 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    object
 9   Urban        400 non-null    object
 10  US           400 non-null    object
dtypes: float64(1), int64(5), object(5)
memory usage: 34.5+ KB

In [6]:
categorical_col=df.select_dtypes(include=['object','category']).columns
categorical_col

Index(['Price', 'ShelveLoc', 'Education', 'Urban', 'US'], dtype='object')

In [8]:
# Output qiymat object bo'lganligi uchun uni mapping qilib oldik

# Mapping
df['US']=df['US'].map({'Yes':1,'No':0})

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    object
 6   ShelveLoc    400 non-null    object
 7   Age          400 non-null    int64
 8   Education    400 non-null    object
 9   Urban        400 non-null    object
 10  US           400 non-null    int64
dtypes: float64(1), int64(6), object(4)
memory usage: 34.5+ KB

In [11]:
# target (mean) encoding
df[categorical_col]=df[categorical_col].apply(lambda col: col.map(df.groupby(col)['US'].mean()))

In [12]:
df.head()

,Sales,CompPrice,Income,Advertising,Population,Price,ShelveLoc,Age,Education,Urban,US
0,9.50,138,73,11,276,0.750000,0.642105,42,0.653061,0.661922,1.0
1,11.22,111,48,16,260,1.000000,0.714286,65,0.770833,0.661922,1.0
2,10.06,113,35,10,269,1.000000,0.621005,59,0.617021,0.661922,1.0
3,7.40,117,100,4,466,0.666667,0.621005,55,0.675000,0.661922,1.0
4,4.15,141,64,3,340,0.583333,0.642105,38,0.581395,0.661922,0.0

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Sales        400 non-null    float64
 1   CompPrice    400 non-null    int64
 2   Income       400 non-null    int64
 3   Advertising  400 non-null    int64
 4   Population   400 non-null    int64
 5   Price        400 non-null    float64
 6   ShelveLoc    400 non-null    float64
 7   Age          400 non-null    int64
 8   Education    400 non-null    float64
 9   Urban        400 non-null    float64
 10  US           400 non-null    float64
dtypes: float64(6), int64(5)
memory usage: 34.5 KB